org/roam/firejail.org
:PROPERTIES:
:ID:       b066a88d-c1c4-43d4-b8b8-cc345ad8467f
:END:
#+title: firejail
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* firejail
** firejail
- .local overrides in ~$XDG_CONFIG_HOME/firejail~
- ~firejail --build=app.profile app~ for creation
- ~firejail --private~ for chroot home dir
- ex. ~noblacklist ${HOME}/.ssh~
  ~whitelist ${HOME}/Videos~
  ~read-write ${HOME}/.password-store~
  ~read-only ${HOME}/.gnupg~
  ~env TR_CURL_SSL_NO_VERIFY=1~ to set transmissions no ssl verification
- ~firejail redshift -l 40.70:-74.00~
